Revit 2026 API

# AdvancedWoodWoodFiberRoughness Property

---

The property labeled "Roughness for secondary highlight" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodFiberRoughness { get; }
```
```vb
Public Shared ReadOnly Property WoodFiberRoughness As String
	Get
```
```cpp
public:
static property String^ WoodFiberRoughness {
	String^ get ();
}
```
```fsharp
static member WoodFiberRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace